In [14]:
import sqlite3
import pandas as pd

In [15]:
conn = sqlite3.connect("../output/education_life_expectancy.db") #if a db doesnt exist, it will be created
print("Connected to sqlite3 database.")

Connected to sqlite3 database.

In [16]:
life_both=pd.read_csv("../output/life_expectancy_both_clean.csv")
life_both.head()

                             Country  Year  LifeExp_Both
0  ADB region: Central and West Asia  2025       69.1302
1  ADB region: Central and West Asia  2024       68.9834
2  ADB region: Central and West Asia  2023       68.8211
3  ADB region: Central and West Asia  2022       68.5124
4  ADB region: Central and West Asia  2021       66.4149

In [17]:
life_both.to_sql("life_both", conn, if_exists="replace", index=False)
print("DataFrame written to sqlite3 database.")
#equivalent to python .import life_expectancy_both_clean.csv life_both

DataFrame written to sqlite3 database.

In [18]:
pd.read_sql_query("SELECT * FROM life_both LIMIT 5;", conn)

                             Country  Year  LifeExp_Both
0  ADB region: Central and West Asia  2025       69.1302
1  ADB region: Central and West Asia  2024       68.9834
2  ADB region: Central and West Asia  2023       68.8211
3  ADB region: Central and West Asia  2022       68.5124
4  ADB region: Central and West Asia  2021       66.4149

In [19]:
primary   = pd.read_csv("../output/primary_clean.csv")
secondary = pd.read_csv("../output/secondary_clean.csv")
tertiary  = pd.read_csv("../output/tertiary_clean.csv")
exp_gdp   = pd.read_csv("../output/cleaned_education_expenditure_gdp.csv")
exp_total = pd.read_csv("../output/exp_total_clean.csv")

In [20]:
primary.to_sql("primary", conn, if_exists="replace", index=False)
secondary.to_sql("secondary", conn, if_exists="replace", index=False)
tertiary.to_sql("tertiary", conn, if_exists="replace", index=False)
exp_gdp.to_sql("exp_gdp", conn, if_exists="replace", index=False)
exp_total.to_sql("exp_total", conn, if_exists="replace", index=False)

print("All tables written to SQLite")

All tables written to SQLite